mermaid fixes
